---
kind: type
id: T:Autodesk.Revit.DB.MullionTypeSetIterator
source: html/8429ed25-0e74-fbce-0806-565dd7105923.htm
---
# Autodesk.Revit.DB.MullionTypeSetIterator

An iterator to a mullion type set.

## Syntax (C#)
```csharp
public abstract class MullionTypeSetIterator : APIObject,
	IEnumerator
```